000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователей/ОповещенияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияПользователей</name>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Копия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытаяКопия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.НастройкиБотов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ТипыСобытийОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОповещения</name>
    <type>
      <types>EnumRef.СпособыОповещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СпособыОповещения/СпособыОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОповещения</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>Telegram</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователей/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.СпособОповещения = Перечисления.СпособыОповещения.Telegram Тогда
			ЭлементРеквизита = ПроверяемыеРеквизиты.Найти("Тема");
			Если ЭлементРеквизита <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ЭлементРеквизита);
			КонецЕсли;
		ИначеЕсли Запись.СпособОповещения = Перечисления.СпособыОповещения.Email Тогда	
			ЭлементРеквизита = ПроверяемыеРеквизиты.Найти("Бот");
			Если ЭлементРеквизита <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ЭлементРеквизита);
			КонецЕсли;
		КонецЕсли;	
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
 
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
